{"modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "Embedding", "config": {"name": "embedding", "trainable": true, "batch_input_shape": [null, 251], "dtype": "float32", "input_dim": 5671, "output_dim": 150, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null, "dtype": "float32"}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 251}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm", "trainable": true, "dtype": null, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 150, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}}, "merge_mode": "concat"}}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 100, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 3780, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 5671, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}, "loss": "categorical_crossentropy", "metrics": ["accuracy"], "weighted_metrics": null, "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of6", "group1-shard2of6", "group1-shard3of6", "group1-shard4of6", "group1-shard5of6", "group1-shard6of6"], "weights": [{"name": "bidirectional/forward_lstm/kernel", "shape": [150, 600], "dtype": "float32", "quantization": {"min": -2.3052625936620372, "scale": 0.018741972306195426, "dtype": "uint8"}}, {"name": "bidirectional/forward_lstm/recurrent_kernel", "shape": [150, 600], "dtype": "float32", "quantization": {"min": -2.541283742119284, "scale": 0.021907618466545552, "dtype": "uint8"}}, {"name": "bidirectional/forward_lstm/bias", "shape": [600], "dtype": "float32", "quantization": {"min": -2.1760261100881237, "scale": 0.015883402263416963, "dtype": "uint8"}}, {"name": "bidirectional/backward_lstm/kernel", "shape": [150, 600], "dtype": "float32", "quantization": {"min": -2.452074701645795, "scale": 0.019774795981014476, "dtype": "uint8"}}, {"name": "bidirectional/backward_lstm/recurrent_kernel", "shape": [150, 600], "dtype": "float32", "quantization": {"min": -2.2019911429461314, "scale": 0.017476120182112153, "dtype": "uint8"}}, {"name": "bidirectional/backward_lstm/bias", "shape": [600], "dtype": "float32", "quantization": {"min": -1.26456918295692, "scale": 0.014535277965022068, "dtype": "uint8"}}, {"name": "dense/kernel", "shape": [100, 3780], "dtype": "float32", "quantization": {"min": -0.33488985697428386, "scale": 0.002462425418928558, "dtype": "uint8"}}, {"name": "dense/bias", "shape": [3780], "dtype": "float32", "quantization": {"min": -0.29817814883940363, "scale": 0.001325236217064016, "dtype": "uint8"}}, {"name": "dense_1/kernel", "shape": [3780, 5671], "dtype": "float32", "quantization": {"min": -67.66425363316256, "scale": 0.2855031798867618, "dtype": "uint8"}}, {"name": "dense_1/bias", "shape": [5671], "dtype": "float32", "quantization": {"min": -24.08427219951854, "scale": 0.09672398473702225, "dtype": "uint8"}}, {"name": "embedding/embeddings", "shape": [5671, 150], "dtype": "float32", "quantization": {"min": -2.652392578125, "scale": 0.020721817016601564, "dtype": "uint8"}}, {"name": "lstm_1/kernel", "shape": [300, 400], "dtype": "float32", "quantization": {"min": -3.5262943950353884, "scale": 0.030663429522046856, "dtype": "uint8"}}, {"name": "lstm_1/recurrent_kernel", "shape": [100, 400], "dtype": "float32", "quantization": {"min": -3.050700028737386, "scale": 0.02500573794047038, "dtype": "uint8"}}, {"name": "lstm_1/bias", "shape": [400], "dtype": "float32", "quantization": {"min": -1.9710258932674631, "scale": 0.013687679814357383, "dtype": "uint8"}}]}]}